Revit 2024 API
ServerPath Members
The ServerPath type exposes the following members.
Constructors
Name | Description
ServerPath
 Constructs a ServerPath
Methods
Name | Description
Compare
 Compares this ModelPath with another
 (Inherited from ModelPath.)
Dispose |  (Inherited from ModelPath.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModelGUID
 A GUID identifying the Revit cloud model.
 (Inherited from ModelPath.)
GetProjectGUID
 A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.
 (Inherited from ModelPath.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CentralServerPath
 The path to the location of the central Revit server or cloud.
 (Inherited from ModelPath.)
CloudPath
 Whether this path represents a path on an Autodesk server such as BIM360.
 (Inherited from ModelPath.)
Empty
 Whether this path is empty
 (Inherited from ModelPath.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ModelPath.)
Region
 The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.
 (Inherited from ModelPath.)
ServerPath
 Whether this path is a server path (as opposed to a file path or cloud path)
 (Inherited from ModelPath.)
See Also
ServerPath Class
Autodesk.Revit.DB Namespace